[SPARTANII X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#00994d'>斯巴达-II</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#00994d'>斯巴达-II计划</font></font><br/>斯巴达-II计划--最初被称为猎户座计划的继承者，是斯巴达计划的一部分。配备雷神锤动力盔甲及进行过改造手术的精英士兵。斯巴达-II计划将是第一个融合先进外骨骼技术和神经植入物手术的项目."

[NanosuitOperative X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#3399ff'>纳米尖兵</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#3399ff'>暴龙</font></font><br/>纳米生化服是一种功能强大、用途极其广泛的战术战斗装甲. 人造纳米肌肉纤维可以被程序化的编辑为多种用途（如硬化，肌肉增强，或隐形）,从而大大增强战斗性能和物理性能，使使用者做出超人类的壮举, 所有纳米服都是共生的，这意味着它们在物理上与使用者结合，成为第二层皮肤的形式. 与使用者最终融为一体."

[GhostOperative X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#bf80ff'>幽灵特工</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#bf80ff'>幽灵计划</font></font><br/>幽灵特工有着强大的灵能天赋，从幼年时期就被挑选并进行灵能训练，联邦通过引导他们的灵能来增幅他们的体质和耐力。成功完成幽灵计划的严格训练和增援应征，士兵将成为突击队和刺客。幽灵的渗透和暗杀能力是无与伦比的."

[GhostOperativePsionics X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#bf80ff'>幽灵特工: 通灵</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#bf80ff'>幽灵计划</font></font><br/>幽灵特工有着强大的灵能天赋，从幼年时期就被挑选并进行灵能训练，联邦通过引导他们的灵能来增幅他们的体质和耐力。成功完成幽灵计划的严格训练和增援应征，士兵将成为突击队和刺客。幽灵的渗透和暗杀能力是无与伦比的."

[NinjaNinjutsuArts X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#595959'>隼忍: 忍术</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#595959'>隼流忍传</font></font><br/>隼流忍者是精锐的刺客，他们使用高超的技艺来执行任务，如间谍，渗透和暗杀。从幼年时期就开始接受隼之里的特别训练，只有在完成测试和训练之后，才能被称为隼忍。所有成员都是具有高超技巧和神秘技艺的专家，他们的潜力是用语言都无法描述的."

[NinjaNinpoArts X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#595959'>隼忍: 忍法</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#595959'>隼流忍传</font></font><br/>隼流忍者是精锐的刺客，他们使用高超的技艺来执行任务，如间谍，渗透和暗杀。从幼年时期就开始接受隼之里的特别训练，只有在完成测试和训练之后，才能被称为隼忍。所有成员都是具有高超技巧和神秘技艺的专家，他们的潜力是用语言都无法描述的."

[NinjaBladeArts X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#595959'>隼忍: 忍刀</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#595959'>隼流忍传</font></font><br/>忍刀让忍者可以完全掌握太刀和苦无，将他们的体术发挥到极限."

[NinjaImprovisationArts X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#595959'>隼忍: 兵法</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#595959'>隼流忍传</font></font><br/>隼忍可利用战术技巧，在战场上更好地观察和移动，使他克服最困难的情况."

[Cyborg X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#ff8000'>赛博格</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#ff8000'>赛博格改造</font></font><br/>一名生化电子人, 拥有着生物特性及机械部位，人们称他为赛博格,机械部分并不是单纯的假肢，因为它们不仅替代了被替换的身体部件，而且以各种方式增强了他的拥有者。赛博格装备有一个外骨骼-生物电子义体-提供各种优势。他们的身体配备了一个战斗能量系统，使他们能够克服战场上的各种情况，但是他们的可用能量在每次任务中是有限的."

[N7DestroyerSoldier X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#990000'>N7-毁灭战士</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#990000'>N7荣誉</font></font><br/>这些士兵无处不在，必须在里约热内卢与巴西的星际战术学院接受训练，才能最终成为星联的特种部队。他们必须在战斗环境中以优秀和有效的方式中生存下来，才能获得属于精英的军衔-N7。毁灭者战士是全能战士，他们的天赋集中在提高耐久性和伤害上。他们的肾素激发将极大地提高了他们的战斗力."

[N7ShadowInfiltrator X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#990000'>N7-暗影渗透者</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#990000'>N7荣誉</font></font><br/>这些士兵无处不在，必须在里约热内卢与巴西的星际战术学院接受训练，才能最终成为星联的特种部队。他们必须在战斗环境中以优秀和有效的方式中生存下来，才能获得属于精英的军衔-N7。暗影渗透者使用植入物来提高敏捷性，使他们在战场上成为身手矫捷的战士。战术披风是一件重要的工具，极大地增加了他们在战场上的暗杀、渗透和生存潜能."

[N7DemolisherEngineer X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#990000'>N7-爆破工程师</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#990000'>N7荣誉</font></font><br/>这些士兵无处不在，必须在里约热内卢与巴西的星际战术学院接受训练，才能最终成为星联的特种部队。他们必须在战斗环境中以优秀和有效的方式中生存下来，才能获得属于精英的军衔-N7。爆破工程兵增加了技术伤害，并获得了持续供应的手雷，以进一步提高他的破坏能力。他有能力摧毁优先目标，并使用手雷对范围内的敌人进行恐吓与伤害.是顶级的团队协助者."

[N7PaladinSentinel X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#990000'>N7-骑士哨兵</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#990000'>N7荣誉</font></font><br/>这些士兵无处不在，必须在里约热内卢与巴西的星际战术学院接受训练，才能最终成为星联的特种部队。他们必须在战斗环境中以优秀和有效的方式中生存下来，才能获得属于精英的军衔-N7。骑士哨兵在战场上携带一面坚硬的盾牌来阻挡敌人的火力。同时，他们也使用盾牌作为近战的武器."

[N7BioticTraining X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#990000'>N7-生物异能</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#990000'>N7荣誉</font></font><br/>这些士兵无处不在，必须在里约热内卢与巴西的星际战术学院接受训练，才能最终成为星联的特种部队。他们必须在战斗环境中以优秀和有效的方式中生存下来，才能获得属于精英的军衔-N7。N7-生物异能对<font color='#990000'>N7-狂暴强化人</font>和<font color='#990000'>N7-屠戮先锋</font>这两个异能职业都是必需的."

[N7FuryAdept X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#990000'>N7-狂暴强化人</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#990000'>N7荣誉</font></font><br/>这些士兵无处不在，必须在里约热内卢与巴西的星际战术学院接受训练，才能最终成为星联的特种部队。他们必须在战斗环境中以优秀和有效的方式中生存下来，才能获得属于精英的军衔-N7。狂暴是终极的异能者，能够用心灵的力量影响物质世界，擅长使用强而持久的质量效应场.他们能够利用异能粗暴地操纵环境中的物体，包括附近的敌方目标."

[N7SlayerVanguard X2UniversalSoldierClassInfo]
ClassSpecializationTitle="<font color='#990000'>N7-屠戮先锋</font>"
ClassSpecializationSummary="<font color='#CC0000'>需求: <font color='#990000'>N7荣誉</font></font><br/>这些士兵无处不在，必须在里约热内卢与巴西的星际战术学院接受训练，才能最终成为星联的特种部队。他们必须在战斗环境中以优秀和有效的方式中生存下来，才能获得属于精英的军衔-N7。屠戮先锋是强大的战斗人员，他们能够将强化人与战士的进攻力量结合起来。他们可以使用各种武器和生物异能."